/****************************************************************************************

****************************************************************************************/
#include "config.h"

TCOLOR  	gui_disp_buf[GUI_LCM_YMAX][GUI_LCM_XMAX/8];				// 声明GUI显示缓冲区

/* 定义LCM地址 */
// #define  TG240128_COM    	(*((volatile unsigned short *) 0x83000002))
// #define  TG240128_DAT    	(*((volatile unsigned short *) 0x83000000))
// 	

/***********************************************************************
* 名称：LCD_WriteCommand()
* 功能：写命令子程序。(发送命令前，不检查液晶模块的状态)
* 入口参数：command  	要写入LCM的命令字
* 出口参数：无
* 说明：函数会设置LCM数据总线为输出方式
***********************************************************************/
#define   LCD_WriteCommand(command)  TG240128_COM = (uint16)command


/***********************************************************************
* 名称：LCD_WriteData()
* 功能：写数据子程序。(发送数据前，不检查液晶模块的状态)
* 入口参数：dat  	要写入LCM的数据
* 出口参数：无
* 说明：函数会设置LCM数据总线为输出方式
***********************************************************************/
#define  LCD_WriteData(dat)  TG240128_DAT = (uint16)dat



/***********************************************************************
* 名称：LCD_ReadState()
* 功能：读取状态字子程序。
* 入口参数：无
* 出口参数：返回值即为读出的状态字
* 说明：函数会设置LCM数据总线为输入方式
***********************************************************************/
#define  LCD_ReadState()	TG240128_COM


/***********************************************************************
* 名称：LCD_ReadData()
* 功能：读取数据子程序。
* 入口参数：无
* 出口参数：返回值即为读出的数据
* 说明：函数会设置LCM数据总线为输入方式
***********************************************************************/
#define  LCD_ReadData()		TG240128_DAT

/* 以下为LCM的用户接口层，主要负责解释用户命令，并发送到LCM，为用户编程提供接口 */


/***********************************************************************
* 名称：LCD_Initialize()
* 功能：LCM初始化，将LCM初始化为纯图形模式，显示起始地址为0x0000，。
* 入口参数：无
* 出口参数：无
* 说明：函数会设置LCM数据总线为输出方式
***********************************************************************/

extern void Initial_Lcd();
void  LCD_Initialize(void)
{  
	Initial_Lcd();
}


/***********************************************************************
* 名称：LCD_FillAll()
* 功能：LCD填充。以图形方式进行填充，起始地址为0x0000。
* 入口参数：dat		要填充的数据
* 出口参数：无
***********************************************************************/
void  LCD_FillAll(uint8 dat)
 {  
//uint32  i;

//    LCD_WriteTCommand3(LCD_ADR_POS, 0x00, 0x00);			// 置地址指针
//    LCD_WriteTCommand1(LCD_AUT_WR);						// 自动写
//    for(i=0;i<128*30;i++)
//    {  LCD_WriteTData1(dat);								// 写数据
//    }
//    LCD_WriteTCommand1(LCD_AUT_OVR);						// 自动写结束
//    LCD_WriteTCommand3(LCD_ADR_POS,0x00,0x00);			// 重置地址指针
}


/****************************************************************************
* 名称：LCD_UpdatePoint()
* 功能：在指定位置上画点，刷新某一点。
* 入口参数： x		指定点所在列的位置
*           y		指定点所在行的位置
* 出口参数：返回值为1时表示操作成功，为0时表示操作失败。
* 说明：操作失败原因是指定地址超出缓冲区范围。
****************************************************************************/
void  LCD_UpdatePoint(uint32 x, uint32 y)
{  
// 	int32  addr; 
//  
//    /* 找出目标地址 */
//    addr = y*(GUI_LCM_XMAX>>3) + (x>>3);
//    LCD_WriteTCommand3(LCD_ADR_POS, addr&0xFF, addr>>8);	// 置地址指针
//    
//    /* 输出数据 */
//    LCD_WriteTCommand2(LCD_INC_WR, gui_disp_buf[y][x>>3]);
}



/****************************************************************************
*                    与LCM相关的GUI接口函数
****************************************************************************/


/****************************************************************************
* 名称：GUI_FillSCR()
* 功能：全屏填充。直接使用数据填充显示缓冲区。
* 入口参数：dat		填充的数据(对于黑白色LCM，为0的点灭，为1的点显示)
* 出口参数：无
****************************************************************************/
void  GUI_FillSCR(uint8 dat)
{  
// 	
// 	uint32  i, j;

//    for(i=0; i<GUI_LCM_YMAX; i++)		// 历遍所有行
//    {  for(j=0; j<GUI_LCM_XMAX/8; j++)	// 历遍所有行
//       {  gui_disp_buf[i][j] = dat;		// 填充数据
// 	  }
//    }
//    
//    /* 填充LCM */
//    LCD_FillAll(dat);
}


/****************************************************************************
* 名称：GUI_Initialize()
* 功能：初始化GUI，包括初始化显示缓冲区，初始化LCM并清屏。
* 入口参数：无
* 出口参数：无
****************************************************************************/
void  GUI_Initialize(void)
{  
 	 LCD_Initialize();					// 初始化LCM模块工作模式，纯图形模式
//    GUI_FillSCR(0x00);					// 初始化缓冲区为0x00，并输出屏幕(清屏)
} 


/****************************************************************************
* 名称：GUI_ClearSCR()
* 功能：清屏。
* 入口参数：无
* 出口参数：无
* 说明：用户根据LCM的实际情况编写此函数。
****************************************************************************/
void  GUI_ClearSCR(void)
{  
	//GUI_FillSCR(0x00);
}


//uint8 const  DCB_HEX_TAB[8] = {0x80, 0x40, 0x20, 0x10, 0x08, 0x04, 0x02, 0x01};

/****************************************************************************
* 名称：GUI_Point()
* 功能：在指定位置上画点。
* 入口参数： x		指定点所在列的位置
*           y		指定点所在行的位置
*           color	显示颜色(对于黑白色LCM，为0时灭，为1时显示)
* 出口参数：返回值为1时表示操作成功，为0时表示操作失败。(操作失败原因是指定地址超出有
*          效范围)
* 说明：用户根据LCM的实际情况编写此函数。对于单色，只有一个位有效，则要使用左移的方法
*      实现point_dat = (point_dat&MASK_TAB [i]) | (color<<n)，其它位数的一样
*      处理。
****************************************************************************/
uint8  GUI_Point(uint32 x, uint32 y, TCOLOR color)
 {  /* 参数过滤 */
//    if(x>=GUI_LCM_XMAX) return(0);
//    if(y>=GUI_LCM_YMAX) return(0);
//    
//    /* 设置缓冲区相应的点 */
//    if( (color&0x01) != 0 ) gui_disp_buf[y][x>>3] |= DCB_HEX_TAB[x&0x07];
//       else  gui_disp_buf[y][x>>3] &= (~DCB_HEX_TAB[x&0x07]);

//    /* 刷新显示 */
//    LCD_UpdatePoint(x, y);
   return(1);
}

/****************************************************************************
* 名称：GUI_ReadPoint()
* 功能：读取指定点的颜色。
* 入口参数：x			指定点所在列的位置
*          y		指定点所在行的位置
*          ret		保存颜色值的指针
* 出口参数：返回0时表示指定地址超出有效范围。
* 说明：对于单色，设置ret的d0位为1或0，4级灰度则为d0、d1有效，8位RGB则d0--d7有效，
*      RGB结构则R、G、B变量有效。
****************************************************************************/
int  GUI_ReadPoint(uint32 x, uint32 y, TCOLOR *ret)
{  
// 	TCOLOR  bak;

//    /* 参数过滤 */
//    if(x>=GUI_LCM_XMAX) return(0);
//    if(y>=GUI_LCM_YMAX) return(0);
//   
//    /* 取得该点颜色(用户自行更改) */ 
//    bak = gui_disp_buf[y][x>>3];
//    if( (bak&DCB_HEX_TAB[x&0x07])!=0 ) *ret = 1;
//       else  *ret = 0;
   
   return(1);
}


/****************************************************************************
* 名称：GUI_HLine()
* 功能：画水平线。
* 入口参数： x0		水平线起点所在列的位置
*           y0		水平线起点所在行的位置
*           x1      水平线终点所在列的位置
*           color	显示颜色(对于黑白色LCM，为0时灭，为1时显示)
* 出口参数：无
* 说明：操作失败原因是指定地址超出缓冲区范围。
****************************************************************************/
void  GUI_HLine(uint32 x0, uint32 y0, uint32 x1, uint8 color) 
{  
// 	
// 	uint32  bak;

//    if(x0>x1) 						// 对x0、x1大小进行排列，以便画图
//    {  bak = x1;
//       x1 = x0;
//       x0 = bak;
//    }
//    if(x0==x1)
//    {  GUI_Point(x0, y0, color);
//       return;
//    }
//    
//    do
//    {  /* 设置相应的点为1 */
//       if(0!=color) gui_disp_buf[y0][x0>>3] |= DCB_HEX_TAB[x0&0x07];
//          else  gui_disp_buf[y0][x0>>3] &= (~DCB_HEX_TAB[x0&0x07]);
//       /* 刷新显示(一次刷新一字节) */
//       if( (x0&0x07)==0x07 ) LCD_UpdatePoint(x0, y0);
//       
//       x0++;
//    }while(x1>x0);
//    
//    /* 对最后一点显示操作 */
//    if(0!=color) gui_disp_buf[y0][x0>>3] |= DCB_HEX_TAB[x0&0x07];
//       else  gui_disp_buf[y0][x0>>3] &= (~DCB_HEX_TAB[x0&0x07]);
//    LCD_UpdatePoint(x0, y0);
}


/****************************************************************************
* 名称：GUI_RLine()
* 功能：画垂直线。
* 入口参数： x0		垂直线起点所在列的位置
*           y0		垂直线起点所在行的位置
*           y1      垂直线终点所在行的位置
*           color	显示颜色(对于黑白色LCM，为0时灭，为1时显示)
* 出口参数：无
* 说明：操作失败原因是指定地址超出缓冲区范围。
****************************************************************************/
void  GUI_RLine(uint32 x0, uint32 y0, uint32 y1, uint8 color) 
{  
// 	uint32  bak;

//    if(y0>y1) 						// 对y0、y1大小进行排列，以便画图
//    {  bak = y1;
//       y1 = y0;
//       y0 = bak;
//    }
//    if(y0==y1)
//    {  GUI_Point(x0, y0, color);
//       return;
//    }
//    
//    do
//    {  GUI_Point(x0, y0, color);		// 逐点显示，描出垂直线
//       y0++;
//    }while(y1>y0);
//    GUI_Point(x0, y0, color);	
}






















